<%@ Page Title="" Language="C#" MasterPageFile="~/Main.master" AutoEventWireup="true" CodeFile="Music.aspx.cs" Inherits="Music" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="Server">
    <title>מוזיקה</title>
    <link href="Code/FadeAnimation.css" rel="stylesheet" />
    <link href="Code/Pages/Pages%20CSS.css" rel="stylesheet" />
    <script src="Code/Pages/mainJS.js"></script>
    <script src="jquery-2.2.0.min.js"></script>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="Server">
    <div id="pages">
        <div class="mFirst" id="mFirst">iu</div>
        <h1 id="fHeader">רקע</h1>
        <hr class="bgMusic"/>
        <div id="pFirst">
            <p>מוזיקה היא אמנות סידור הצליל והשקט בזמן. </p>
            <p>מרכיביה העיקריים הם גובה צליל (האחראי על מלודיה והרמוניה), קצב (מפעם, משקל ), דינמיקה, גוון ומרקם. המילה "מוזיקה" נובעת מהמילה היוונית μουσική ("מוזיק"), "(האמנות) של המוזות"."מוזה" משמשת כמילה כמעט נרדפת למילה "השראה", במיוחד בחיבור יצירות.</p>
        </div>
        <div class="mSecond" id="mSecond"></div>
        <h1>ג'אז</h1>
        <hr class="Jazz"/>
        <p id="pSecond">בתחילת המאה ה-20 התפתח סגנון מוזיקלי  חדש הידוע בשם ג'אז. הג'אז הפך לאחד מסגנונות המוזיקה החשובים ביותר. זהו סגנון מוזיקלי שמקורו בהיתוך של מסורות מוזיקליות אפריקאיות ואירופאיות אשר התרחש בתחילת המאה ה-20 בקהילות אפרו-אמריקאיות בדרום ארצות הברית. שורשיו המערב אפריקאים ניכרים בשימוש שלו בבלו נוטס, אלתור, פוליריתמיקה, סינקופות ושמיניות סווינג.‏ הג'אז ספח לתוכו, מתחילת דרכו ועד היום, קטעים נבחרים מהמוזיקה הפופולרית האמריקאית של המאה ה-19 והמאה ה-20.‏ בנוסף הוא הוליד מגוון של תתי-סגנונות, מהדיקסילנד של ניו אורלינס בעשור השני של המאה ה-20 ועד הפיוז'ן בשנות ה-70 וה-80.</p>
        <div class="mThird" id="mThird"></div>
        <h1>תיווי</h1>
        <hr class="Tabs"/>
        <hr class="bgMusic"/>
        <p id="pThird">את שמות התווים ואת החמשה המוזיקלית המציא במאה ה-11 נזיר איטלקי בשם "גוידו דה ארצו". הדרך שבה מועברת מוזיקה ממוזיקאי למוזיקאי היא בדרך כלל בתווים (אף על פי שלעתים קרובות מועברת מוזיקה באמצעות האוזן, כלומר, המבצע לומד את היצירה משמיעה בלבד, ללא צורך בהסברים או תווים). יצירות תזמורתיות נכתבות בפרטיטורה, המשמשת את המנצח, וכל נגן מקבל תווים עם התפקיד שנועד לקבוצת הכלים שלו, לפי הצורך. ביצירות כוראליות גדולות תקבל כל קבוצת קולות במקהלה את תווי התפקיד המיועד לה ואילו ביצירות קטנות, כגון כוראלים או לידר, שרים כל חברי המקהלה מדפי תווים, המכילים את כל התפקידים. התווים המוכרים כיום החלו להתפתח באירופה במאה ה-14 בערך, מן הנוימות והתווים המרובעים שקדמו להם. בדפי התווים מצוינים כל האספקטים המוזיקליים שהוזכרו קודם - גובה, משך, עוצמה, צבע וגוון. לעתים מצוינים בתיווי גם דברים נוספים, כמו קצב, אופי המוזיקה, אווירה, או מהלך הרמוני. </p>
    </div>
</asp:Content>

