<%@ Page Title="" Language="C#" MasterPageFile="~/Main.master" AutoEventWireup="true" CodeFile="Rock.aspx.cs" Inherits="Rock" %>

<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="Server">
    <link href="Code/FadeAnimation.css" rel="stylesheet" />
    <link href="Code/Pages/Pages%20CSS.css" rel="stylesheet" />
    <script src="Code/Pages/mainJS.js"></script>
    <script src="jquery-2.2.0.min.js"></script>
    <title>רוק</title>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="Server">
    <div id="pages">
        <div id="First" class="rFirst"></div>
        <div>
            <h1 id="rhFirst">רקע על הסגנון</h1>
            <hr class="rBg" />
            <div id="pFirst">
                <p>רוק - סגנון מוזיקלי ותרבותי שהתפתח בשנות ה-50 בארצות הברית בעקבות המהפכה האלקטרונית בבלוז, ואשר ממנו התפתח הרוק בשנות ה-60.</p>
                <p>הרוק כפי שהוא מוכר לנו היום מורכב ממאות סגנונות - מרוק קלאסי ועד רוק מתקדם, מרוק אלטרנטיבי ועד רוק כבד. אם נמשיל את הרוק לעץ עצום, כל אחד מהסגנונות האלו הוא ענף קטן שבוקע מתוך ענפים גדולים ממנו. מתוך הרוק יצאו גם סגנונות מוזיקליים שלמים, שהמגוון המוזיקלי שלהם עצום והם התרחקו מאוד מהבסיס, כגון הבי מטאל או פאנק (Punk). כל ה"ענפים" האלו, אם נמשיך באותו המשל, יצאו מתוך הגזע, והוא הרוק'נרול. וגם הוא יצא מתוך בסיס - הבלוז. בתחתית שורשיו נמצא הדלתא בלוז, שעבר גלגולים רבים בטרם נבטו הסגנונות הרבים.</p>
                <p>בשנות ה-40 וה-50 החלה המהפכה האלקטרונית במוזיקה, בראשה הבלוז. בעוד שבעבר הבלוז היווה בסה"כ שירת עבודה, בשנים אלה מנגינות הבלוז עברו עיבוד אלקטרוני-מודרני וסגנון זה הפך לבסיס של הנגינה בגיטרה חשמלית. התפתחויות אלה הובילו ללידתו של הרוק אנד רול: גרסה הרבה יותר מהירה ושמחה לבלוז. הרוק אנד רול, או בקיצור, רוק'נרול, ירש מהבלוז הן את טכניקת הנגינה, ואת הקצב. הרוקנרול "שיגע" את אמריקה, ובייחוד לאור העובדה, שבשונה מהבלוז, כוכבי הרוקנרול היו לבנים.</p>
            </div>
        </div>
        <div id="Second" class="rSecond"></div>
        <div>
            <h1 id="rhSecond">רוק בישראל</h1>
            <hr class="Israel" />
            <div id="pSecond">
                <p>בראשית הדרך, היה הרוק תרבות מוקצה בישראל, שבשנות ה-60 הייתה עדיין חברה מגויסת וסגורה יחסית להשפעות תרבותיות מערביות. חלוץ הרוק הישראלי והראשון שהקליט רוק בעברית היה בצלאל יונגרייז, שבשנת 1962 הקליט את השיר "ילדונת".</p>
                <p>להקות הרוק הראשונות בישראל היו "להקות הקצב", שהחלו לפעול באמצע העשור במועדוני לילה ודיסקוטקים. לקראת סוף העשור השתכללה סצנת להקות הקצב ואף זכתה למעט לגיטימציה, בעיקר לאחר מלחמת ששת הימים כאשר מוזיקאים מערביים החלו להגיע לישראל והשפעות מהפכת הפופ החלו לחלחל לתרבות המקומית. בגל השני של להקות הקצב התבלטו שלוש להקות עיקריות כמובילות סצנת הרוק המקומית: הצ'רצ'ילים, האריות והסופרגרופ עוזי והסגנונות.</p>
                <p>בתפר שבין שנות ה-60 וה-70 החלה התעניינות ברוק מצד האמנים המצליחים של הממסד המוזיקלי ורבים מהם השתעשעו בהקלטת שירים בסגנון הרוק ובעבודה משותפת עם להקות הקצב. מי שעשה את הצעד המשמעותי ביותר לקראת אימוץ הרוק כאסתטיקה דומיננטית במוזיקה הישראלית היה אריק איינשטיין, שבשנת 1969 הפך את הצ'רצ'ילים ללהקת הליווי הקבועה שלו בהופעות ובתקליטים.</p>
                <p>להקת הרוק המצליחה הראשונה ששרה בעברית, הייתה כוורת, אשר החלה את דרכה בשנות ה-70. כוורת נחשבת כפורצת דרך במוזיקה הישראלית כשהצליחה לשלב בין מוזיקת פופ להומור והעלתה את הפופ והרוק ללב המיינסטרים.</p>
                <p>שנת 1991 הייתה שנת הפריצה של להקות וזמרי הרוק האלטרנטיבי, בראשותם של רמי פורטיס, ברי סחרוף ואביב גפן, ולהקות צעירות כמו איפה הילד?, זקני צפת, רוקפור ומופע הארנבות של ד"ר קספר זכו לפופולריות רבה.</p>
                <p>בין הלהקות הבולטות של העשור הראשון של המאה ה-21 יש לציין את בית הבובות, המנגנת רוק מלודי עם דגש על גיטרה אקוסטית, מוניקה סקס ואת סינרגיה, הנוטה לכיוון של ניו מטאל מלודי.</p>
            </div>
        </div>
        <div id="Third" class="rThird"></div>
        <div>
            <h1 id="rhTable">הלהקות המשפיעות ביותר:</h1>
            <hr class="rTable"/>
            <table>
                <tr>
                    <td>

                        <li>The Sex Pistols</li>

                    </td>
                    <td>- למרות שפעלו לאורך 3 שנים ההשפעה שלהם על סגנון הפאנק קיימת עד היום
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>Pink Floyd</li>
                    </td>
                    <td>- יודעים על שירי המחאה שלהם וכחלק מהלהקות שהכניסו את הסגנון הפסכידלי למיינסטרים
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>The Rolling Stones</li>
                    </td>
                    <td>- אחת מהלהקות המשפעיות ביותר על הסגנון ואחת הלהקות שפעילות לארוך הכי הרבה שנים בסגנון
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>David Bowie</li>
                    </td>
                    <td>ממייסדי הסגנון ה-Gleam Rock וידוע גם בגלל העזרה שלו להביא למיינסטרים נטיות מניות שונות ולעזור לקבל אותם
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>The Velvet Underground </li>
                    </td>
                    <td>- אחת הלהקות החשובות ביותר לסגנונות Altrnative Rock ו Experimental Rock
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>Frank Zappa </li>
                    </td>
                    <td>- ידוע בגלל כמו האלבומים שהוא הוציא(60) ועל ההתנסות שלו עם צלילים חדשים שהשפיעו על סגנונות רבים
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>The Beatles</li>
                    </td>
                    <td>- אחת מהלהקות הידעות ומצליחות בכל הזמנים הביאו את סגנון הרוק למיינסטרים והפכו אותו לסגנון הפופ של אותם זמנים
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>Led Zepplin </li>
                    </td>
                    <td>- נחשבת ללהקת ה-Hard Rock  הראשונה 
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>Evlis Presley </li>
                    </td>
                    <td>- שילב סגנונות שונים עם רוק כמו RnB וגרם להשפעה רבה 
                    </td>
                </tr>
                <tr>
                    <td>
                        <li>Jimi Hendrix </li>
                    </td>
                    <td>- אחד מנגיני הגיטרה החשובים במוזיקה בכל הזמנים
                    </td>
                </tr>
            </table>
        </div>
    </div>

</asp:Content>

